export const responseList = {
  authentication: {
    "email-validation": "فرمت ایمیل وارد شده صحیح نمی باشد.",
    "workId-validation": "شناسه همیار به صورت عدد و سه رقم میباشد.",
    "phone-validation": "شماره تلفن وارد شده معتبر نمیباشد.",
    "success-signup": "با موفقیت ثبت نام شدید.",
    "success-login": "با موفقیت وارد شدید.",
    "failed-login": "ایمیل وجود ندارد یا رمز عبور اشتباه است.",
    "password-match": "رمز عبور با تکرار آن یکسان نمیباشد.",
    "success-verify-phone": "پیامک با موفقیت ارسال شد.",
    "failed-verify-phone": "متاسفانه پیامک ارسال نشد؛ لطفا مجددا امتحان کنید.",
    "success-verify-code": "کد ارسالی با کد وارد شده سازگار است.",
    "failed-verify-code": "کد ارسالی با کد وارد شده مطابقت ندارد.",
    "success-change-password":"رمز عبور شما با موفقیت تغییر یافت.",
    "failed-change-password":"متاسفانه رمز عبور شما تغییر نکرد؛ لطفا مجددا امتحان کنید."
  },
  order: {
    "failed-get-location": "امکان دستیابی به موقعیت فعلی شما وجود ندارد.",
    "success-order": "سفارش شما با موفقیت ثبت شد.",
    "success-pay": "سفارش شما با موفقیت پرداخت شد؛ منتظر تایید ادمین باشید.",
    "failed-order": "متاسفانه سفارش شما ثبت نشد.",
    "failed-pay": "متاسفانه پرداخت سفارش انجام نشد؛ لطفا مجددا امتحان کنید.",
    "success-submit-comment": "بازخورد شما با موفقیت ثبت شد.",
    "failed-submit-comment":
      "متاسفانه بازخورد شما ثبت نشد؛لطفا مجدد امتحان کنید.",
    "success-cancel": "سفارش با موفقیت لغو شد.",
    "failed-cancel": "سفارش لغو نشد؛ لطفا مجددا امتحان کنید.",
    "success-finish": "اتمام سفارش با موفقیت ثبت شد.",
    "failed-finish": "اتمام سفارش ثبت نشد؛ لطفا مجددا امتحان کنید.",
    "success-change-worker-status": "تغییر وضعیت اعمال شد.",
    "failed-change-worker-status":
      "تغییر وضعیت اعمال نشد؛ لطفا مجددا امتحان کنید.",
    "success-select-worker":
      "همیار مورد نظرتان برای انجام سرویس با موفقیت انتخاب شد.",
    "failed-select-worker":
      "متاسفانه همیار موردنظرتان انتخاب نشد؛ لطفا مجددا امتحان کنید.",
  },
};
