<template>
  <div class="container">
    <div class="about-us">
      <div class="about-us__image-container">
        <img class="about-us__image" src="../assets/images/about-us.webp" />
      </div>
      <div class="about-us__caption">
        <h2 class="about-us__title">درباره ما</h2>
        <div>
          در دنیای پرمشغله امروز، پیدا کردن زمان برای نگهداری از خودرو و حفظ
          ظاهر آن می‌تواند چالش‌برانگیز باشد. در کوییک واش، ما این مشکل را برای
          شما حل کرده‌ایم. هدف ما ارائه‌ی خدماتی است که نه تنها خودروی شما را
          درخشان و تمیز نگه دارد، بلکه راحتی و آسایش شما را نیز فراهم کند. تیم
          حرفه‌ای و باتجربه ما با بهره‌گیری از جدیدترین تکنولوژی‌ها و بهترین
          مواد شوینده، خودروی شما را با دقت و ظرافت تمیز می‌کند. ما می‌دانیم که
          خودرو شما فقط یک وسیله نقلیه نیست؛ بلکه بخشی از سبک زندگی شماست. به
          همین دلیل، ما خود را متعهد به ارائه‌ی خدماتی باکیفیت و درخشان می‌دانیم
          که نه تنها نیازهای فنی، بلکه توقعات زیبایی‌شناسانه شما را نیز برآورده
          کند. یکی از اصول اساسی ما در کوییک واش، احترام به محیط زیست است. ما از
          روش‌ها و تکنولوژی‌های سازگار با محیط زیست استفاده می‌کنیم تا نه تنها
          خودروی شما درخشان شود، بلکه این کار را به گونه‌ای انجام دهیم که کمترین
          تأثیر منفی را بر طبیعت داشته باشد. با استفاده از مواد شوینده غیر سمی و
          تکنولوژی‌های کاهش مصرف آب، سعی می‌کنیم به حفظ منابع طبیعی کمک کنیم. ما
          به اهمیت زمان شما واقف هستیم. با استفاده از سرویس آنلاین کوییک واش،
          شما می‌توانید در هر زمان و مکانی که هستید، سرویس کارواش خود را سفارش
          دهید. بدون نیاز به حضور فیزیکی و اتلاف وقت، تیم ما در محل مورد نظر شما
          حاضر شده و خودروی شما را با بالاترین استانداردها تمیز می‌کند. این یعنی
          شما می‌توانید از وقت خود بهتر استفاده کنید و در عین حال خودرویی تمیز و
          درخشان داشته باشید.
        </div>
      </div>
    </div>
  </div>
</template>
<style scoped lang="scss">
.container {
  background-color: #f9f9f9;
  height: 100vh;
  max-width: 100%;
  padding: 150px 100px;
}
.about-us {
  background-color: white;
  box-shadow: 0 4px 8px 0 rgba(0, 0, 0, 0.2);
  display: flex;
  justify-content: space-between;
  gap: 30px;
  border-radius: 20px;
  padding: 30px;

  &__image {
    width: 100%;
    height: 100%;
    border-radius: 10px;
  }

  &__image-container {
    width: 45%;
    height: 400px;
  }

  &__title{
    color: rgb(92, 91, 91);
  }

  &__caption {
    line-height: 27px;
    width: 55%;
    color:gray;
  }
}
</style>
